app/controllers/doctors_controller.rb

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @doctor = Doctor.find(params[:id])

INSERT INTO "doctors" ("created_at", "name", "phone", "surname", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 10 Nov 2012 14:45:08 UTC +00:00], ["name", "Tymoteusz"], ["phone", "609430104"], ["surname", "Świstek"], ["updated_at", Sat, 10 Nov 2012 14:45:08 UTC +00:00]]
---
  def create
    @doctor = Doctor.new(params[:doctor])

    respond_to do |format|
      if @doctor.save

SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "doctors" WHERE "doctors"."id" = ?  [["id", 1]]
---
  def destroy
    @doctor = Doctor.find(params[:id])
    @doctor.destroy